Documents/Предзаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Предзаказ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиПоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзАкцес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расчетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПоступлениеНаВиртуальныйСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийПриходСкладскойУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходСкладскойУчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзТорговойТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОборудованияОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОборудованияСТорговойТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеУпаковкиОтПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоступилПолностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзАкцес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПроизводители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДатыПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПрямаяПоставкаНаМагазины</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предзаказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Предзаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Предзаказ/Ext/ManagerModule.bsl
Процедура СоздатьПриходныеОрдераПоПредзаказу(Предзаказ, ЗапускИзЗаказа = Неопределено) Экспорт
	
	//Не используется
	
	//++АК Lobv 30.10.2016 обрабатываем создание и редактирование приходных ордеров на виртуальный склад
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	, (Предзаказ.Дата - 30*24*3600));
	Запрос.УстановитьПараметр("Документ", Предзаказ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщикуПредзаказы.Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказПоставщику.Предзаказы КАК ЗаказПоставщикуПредзаказы
	|ГДЕ
	|	ЗаказПоставщикуПредзаказы.Документ = &Документ
	|	И ЗаказПоставщикуПредзаказы.Ссылка.Проведен = ИСТИНА
	|	И ЗаказПоставщикуПредзаказы.Ссылка.Дата >= &Дата";
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	Если МассивЗаказов.Количество() > 0
			И ЗапускИзЗаказа = Неопределено Тогда //значит должен быть приходник
		ДанныеЗаполнения = МассивЗаказов[0];
		//1. надо привести в соответствие дату и пометку удаления
		//2. табличную часть товаров
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Комментарий"	, "Создан автоматически по Предзаказу " + Строка(Предзаказ.Номер));
		Запрос.УстановитьПараметр("Дата"		, (Предзаказ.Дата - 30*24*3600));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдерСклад.Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерСклад КАК ПриходныйОрдерСклад
		|ГДЕ
		|	ПриходныйОрдерСклад.Дата >= &Дата
		|	И ПриходныйОрдерСклад.Комментарий = &Комментарий";
		МассивОрдеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		НужноПерепровестиОрдер = Ложь;
		Если МассивОрдеров.Количество()=0 тогда
			Если Предзаказ.ФормироватьПоступлениеНаВиртуальныйСклад тогда
				ПриходныйОрдер = Документы.ПриходныйОрдерСклад.СоздатьДокумент();
				ПриходныйОрдер.ВидОперации 	= Перечисления.ВидыОперацийПриходСкладскойУчет.ОтПоставщика;
				ПриходныйОрдер.Поставщик	= Предзаказ.Поставщик;
				ПриходныйОрдер.Склад		= Справочники.Склады.НайтиПоКоду("000001835");
				ПриходныйОрдер.Основание	= ДанныеЗаполнения;
				ПриходныйОрдер.НомерДокументаПоставщика = "б/н";
				ПриходныйОрдер.Комментарий	= "Создан автоматически по Предзаказу " + Строка(Предзаказ.Номер);
				СтрокаДоб = ПриходныйОрдер.ЗаказыПоставщику.Добавить();
				СтрокаДоб.Документ = ДанныеЗаполнения;
				НужноПерепровестиОрдер = Истина;
			КонецЕсли;
		Иначе
			ПриходныйОрдер=МассивОрдеров[0].ПолучитьОбъект();
			//ПриходныйОрдер=Документы.ПриходныйОрдерСклад.СоздатьДокумент();
			Если ПриходныйОрдер.Дата<>Предзаказ.Дата
					ИЛИ ПриходныйОрдер.ПометкаУдаления<>Предзаказ.ПометкаУдаления
					ИЛИ ПриходныйОрдер.Товары.Итог("Количество")<>Предзаказ.Товары.Итог("Количество") тогда
				НужноПерепровестиОрдер = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НужноПерепровестиОрдер тогда
			ПриходныйОрдер.Дата=Предзаказ.Дата;
			ПриходныйОрдер.ДатаВремяЗаездаМашины=Предзаказ.Дата;
			ПриходныйОрдер.ВремяЗаездаМашины=Предзаказ.Дата+1;
			ПриходныйОрдер.ВремяОтпускаТовараПроизводителем=Предзаказ.Дата+1;
			ПриходныйОрдер.ДатаДокументаПоставщика=Предзаказ.Дата;
			//ПриходныйОрдер.ПометкаУдаления=Предзаказ.ПометкаУдаления;
			ПриходныйОрдер.Товары.Очистить();
			Если не Предзаказ.ПометкаУдаления тогда
			ТаблицаТоваров=Предзаказ.Товары.Выгрузить();
			ТаблицаТоваров.Свернуть("Номенклатура, Характеристика, ЕдиницаИзмерения","Количество");
			Для каждого СтрТоваровПредзаказа Из ТаблицаТоваров Цикл
				СтрТоваровОрдера=ПриходныйОрдер.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТоваровОрдера,СтрТоваровПредзаказа);
				СтрТоваровОрдера.ЗаказПоставщику=ДанныеЗаполнения;
				СтрТоваровОрдера.ДатаПроизводства=Предзаказ.Дата;
			КонецЦикла; 
			КонецЕсли;
			ПриходныйОрдер.Записать(?(ПриходныйОрдер.ПометкаУдаления, РежимЗаписиДокумента.Запись, РежимЗаписиДокумента.Проведение));
		КонецЕсли;
	ИначеЕсли ЗапускИзЗаказа <> Неопределено тогда //заказ помечается на удаление, иначе шло бы по первому варианту
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата"		, (Предзаказ.Дата - 30*24*3600));
		Запрос.УстановитьПараметр("Комментарий"	, "Создан автоматически по Предзаказу " + Строка(Предзаказ.Номер));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдерСклад.Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерСклад КАК ПриходныйОрдерСклад
		|ГДЕ
		|	ПриходныйОрдерСклад.Дата >= &Дата
		|	И ПриходныйОрдерСклад.Комментарий = &Комментарий";
		МассивОрдеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Для каждого СтрОрдеров Из МассивОрдеров Цикл
			ПриходныйОрдер = СтрОрдеров.ПолучитьОбъект();
			ПриходныйОрдер.Товары.Очистить();
			ПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры
